
# В классе 25 учащихся. Из них 5 человек не умеют играть ни в шашки, ни в шахматы.
# 18 учащихся умеют играть в шашки, 20 - в шахматы. Сколько учащихся класса играют и в шашки, и в шахматы?

18 учащихся умеют играть и в шашки и в шахматы.

# Расставить между цифрами знаки арифметических операций <<+>> <<->> <<*>> <</>> и,
# если надо, скобки так, чтобы ответ оказался равным 1.

(1 + 2) / 3  =  1
1 * 2 + 3 - 4  =  1
(1 + 2) * 3 / (4 + 5)  =  1
(1 + (2 * 3) + 4) / (5 + 6)  =  1
1 * (2 + 3 + 4 + 5) - (6 + 7)  =  1
(1 + 2) / 3 * ((4 + 5 + 6) / (7 + 8))  =  1

# В семье четверо детей; им 5, 8, 13 и 15 лет. Зовут их Таня, Юра, Света и Лена.
# Сколько лет каждому из них, если одна девочка ходит в детский сад.
# Таня старше, чем Юра, а сумма лет Тани и Светы делится на 3?

Таня = 13   
Юра = 8  
Света = 5   
Лена = 15
Сумма лет Тани и Светы делится на 3, значит Тане либо 5, либо 13, но Таня старше Юры, значит Тане 13, Свете 5, Юре 8, а Лене 15

# Найти такой набор из 5 гирь, чтобы, располагая их на одной чаше весов, 
# можно было бы взвесить любой груз до 21 кг включительно с точностью до 1 кг.

1 + 2 + 4 + 8 + 16 = 31

#Пропорции. 
# На одном литре бензина, машина проезжает 13 км. На сколько увеличится расход на 100км, если она будет проезжать 12 км на одном литре.
(100/12)8,33 - (100/13)7,69 = 0,64

# 1л - 13км
# ?л - 100км

# 2л - 20км
# ?л - 100км
# 2/20=x/100
# ?2/x=1/5

